Repository: MikhAndrey/TicTacToe
Catalog: TicTacToe/Resources/Messages.*.resx
Languages: ar, de, es, fr, it, ja, nl, zh

# AllGamesSaveMessage
source: Information about all games saved to file {0}
ar: معلومات حول جميع الألعاب المحفوظة في ملف {0}
de: Informationen über alle gespeicherten Spiele
es: Información sobre todos los juegos guardados
fr: Informations sur tous les jeux enregistrés dans le fichier {0}
it: Informazioni su tutti i giochi salvati nel file {0}
ja: ファイル {0} に保存されたすべてのゲームに関する情報
nl: Informatie over alle games die zijn opgeslagen in bestand {0}
zh: 有關保存到文件 {0} 的所有遊戲的信息

# AskForDataInputMessage
source: Player {0}, enter your id, name and age, separated by space
ar: لاعب {0} ، أدخل المعرف والاسم والعمر مفصولة بمسافة
de: Spieler {0}, geben Sie Ihre ID, Ihren Namen und Ihr Alter getrennt durch ein Leerzeichen ein
es: Jugador {0}, ingresa tu ID, nombre y edad separados por un espacio
fr: Joueur {0}, entrez votre identifiant, votre nom et votre âge séparés par un espace
it: Giocatore {0}, inserisci il tuo ID, nome ed età separati da uno spazio
ja: プレーヤー {0}、ID、名前、年齢をスペースで区切って入力してください
nl: Speler {0}, voer je ID, naam en leeftijd in, gescheiden door een spatie
zh: 玩家 {0}，輸入您的 ID、姓名和年齡，用空格隔開

# AskForEnterCommandMessage
source: Please enter one of the following commands:
ar: الرجاء إدخال أحد الأوامر التالية:
de: Bitte geben Sie einen der folgenden Befehle ein:
es: Por favor, introduzca uno de los siguientes comandos:
fr: Veuillez saisir l'une des commandes suivantes :
it: Inserisci uno dei seguenti comandi:
ja: 次のいずれかのコマンドを入力してください。
nl: Voer een van de volgende opdrachten in:
zh: 請輸入以下命令之一：

# AskForPerformCurrentTurnMessage
source: Player {0}, enter the row number and column number of the cell you would like to occupy, separated by a space
ar: أيها اللاعب {0} ، أدخل رقم الصف ورقم العمود للخلية التي ترغب في شغلها ، مفصولة بمسافة.
de: Spieler {0}, geben Sie die Zeilen- und Spaltennummer der Zelle ein, die Sie besetzen möchten, getrennt durch ein Leerzeichen.
es: Jugador {0}, ingrese el número de fila y el número de columna de la celda que le gustaría ocupar, separados por un espacio.
fr: Joueur {0}, entrez le numéro de ligne et le numéro de colonne de la cellule que vous souhaitez occuper, séparés par un espace.
it: Giocatore {0}, inserisci il numero di riga e di colonna della cella che desideri occupare, separati da uno spazio.
ja: プレーヤー {0}、占有したいセルの行番号と列番号をスペースで区切って入力してください。
nl: Speler {0}, voer het rijnummer en kolomnummer in van de cel die je wilt bezetten, gescheiden door een spatie.
zh: 玩家{0}，輸入您要佔用的單元格的行號和列號，用空格隔開。

# BookedIdErrorMessage
source: This ID is already taken. Try again
ar: هذا المعرف مأخوذ بالفعل. حاول مرة أخرى
fr: Cette pièce d'identité est déjà prise. Réessayer
ja: この ID は既に使用されています。 再試行
nl: Deze ID is al in gebruik. probeer het nog eens
zh: 此 ID 已被佔用。 再試一次

# CurrentTurnPlayerDeclarationMessage
source: Player {0}'s turn
ar: دور اللاعب {0}
de: Spielerzug {0}
es: Turno de jugador {0}
fr: Tour de joueur {0}
it: Turno giocatore {0}
ja: プレーヤー ターン {0}
nl: Speler beurt {0}
zh: 玩家回合 {0}

# DrawMessage
source: Draw!
ar: ألفت!
de: Zeichnen!
es: ¡Dibujar!
fr: Dessiner!
it: Disegno!
ja: 描く！
nl: Tekenen!
zh: 畫！

# FirstCommandMessage
source: generate file with last game's review
ar: إنشاء ملف مراجعة لأحدث لعبة
de: Generieren Sie eine Überprüfungsdatei des neuesten Spiels
es: generar un archivo de revisión del último juego
fr: générer un fichier de révision du dernier jeu
it: generare un file di revisione dell'ultimo gioco
ja: 最新ゲームのレビューファイルを生成する
nl: genereer een beoordelingsbestand van de nieuwste game
zh: 生成最新遊戲的評論文件

# FourthCommandMessage
source: go to the choice between ending the game and starting a new game
ar: اذهب إلى نهاية اللعبة / ابدأ لعبة جديدة
de: Spiel beenden/neues Spiel starten
es: ir al final del juego/comenzar nuevo juego
fr: aller au choix entre terminer le jeu et commencer un nouveau jeu
it: vai a fine partita/inizia nuova partita
ja: ゲームを終了する/新しいゲームを開始する
nl: ga naar het einde van het spel/start een nieuw spel
zh: 在結束遊戲和開始新遊戲之間進行選擇

# GameGetConnectionErrorMessage
source: An error occurred while connecting to the database. Unable to get game data
fr: Une erreur s'est produite lors de la connexion à la base de données. Impossible d'obtenir les données du jeu
zh: 連接數據庫時出錯。 無法獲取遊戲數據

# GameSetConnectionErrorMessage
source: An error occurred while connecting to the database. Unable to write game data
fr: Une erreur s'est produite lors de la connexion à la base de données. Impossible d'écrire les données du jeu

# GamesWithCurrentPlayersSaveMessage
source: Information about all games between current players is saved to file {0}
ar: يتم حفظ المعلومات حول جميع الألعاب بين اللاعبين الحاليين في ملف {0}
de: Informationen über alle Spiele zwischen aktuellen Spielern werden gespeichert
es: Se guarda información sobre todos los juegos entre los jugadores actuales
fr: Les informations sur tous les jeux entre les joueurs actuels sont enregistrées dans le fichier {0}
it: Le informazioni su tutte le partite tra giocatori attuali vengono salvate nel file {0}
ja: 現在のプレーヤー間のすべてのゲームに関する情報は、ファイル {0} に保存されます
nl: Informatie over alle games tussen huidige spelers wordt opgeslagen in bestand {0}
zh: 當前玩家之間所有遊戲的信息保存到文件 {0}

# LanguagesNames
source: Russian English
fr: Russe Anglais Français Allemand Espagnol Italien Néerlandais Portugais Arabe Chinois Japonais
ja: ロシア語 英語 フランス語 ドイツ語 スペイン語 イタリア語 オランダ語 ポルトガル語 アラビア語 中国語 日本語
zh: 俄語 英語 法語 德語 西班牙語 意大利語 荷蘭語 葡萄牙語 阿拉伯語 中文 日語

# LastGameSaveMessage
source: Information about the last game was successfully saved to the file {0}
ar: معلومات حول جميع الألعاب المحفوظةتم حفظ المعلومات الخاصة باللعبة الأخيرة بنجاح في الملف {0}
de: Letzte Spielinformationen erfolgreich gespeichert
es: La información del último juego se guardó con éxito
fr: Les informations sur le dernier jeu ont été enregistrées avec succès dans le fichier {0}
it: Le informazioni sull'ultimo gioco sono state salvate correttamente nel file {0}
ja: 前回のゲームに関する情報がファイル {0} に正常に保存されました
nl: Informatie over de laatste game is succesvol opgeslagen in het bestand {0}
zh: 有關上一場比賽的信息已成功保存到文件 {0}

# NonIntegerAgeMessage
source: Your age must be an integer. Please, try again
ar: يجب أن يكون عمرك عددًا صحيحًا. حاول مرة اخرى
de: Ihr Alter muss eine Ganzzahl sein. Bitte versuche es erneut
es: Su edad debe ser un número entero. Inténtalo de nuevo
fr: Votre âge doit être un nombre entier. Veuillez réessayer
it: La tua età deve essere un numero intero. Per favore riprova
ja: 年齢は整数でなければなりません。もう一度お試しください
nl: Uw leeftijd moet een geheel getal zijn. Probeer het opnieuw
zh: 您的年齡必須是整數。請再試一次

# NonIntegerIdMessage
source: Your id must be an integer. Please, try again
ar: يجب أن يكون المعرف الخاص بك عددًا صحيحًا. حاول مرة اخرى
de: Ihre ID muss eine Ganzzahl sein. Bitte versuche es erneut
es: Su identificación debe ser un número entero. Inténtalo de nuevo
fr: Votre identifiant doit être un entier. Veuillez réessayer
it: Il tuo ID deve essere un numero intero. Per favore riprova
ja: ID は整数でなければなりません。もう一度お試しください
nl: Uw ID moet een geheel getal zijn. Probeer het opnieuw
zh: 您的 id 必須是整數。請再試一次

# PlayerConnectionErrorMessage
source: An error occurred while connecting to the database. Unable to write player data
fr: Une erreur s'est produite lors de la connexion à la base de données. Impossible d'écrire les données du joueur
zh: 連接數據庫時出錯。 無法寫入玩家數據

# RepeatConfirmMessage
source: Do you want to play again? (Enter - yes, any other key - no)
ar: هل تريد اللعب مرة أخرى؟ (أدخل - نعم ، أي مفتاح آخر - لا)
de: Willst du wieder spielen? (Eingabe - ja, jede andere Taste - nein)
es: ¿Quieres jugar de nuevo? (Intro - sí, cualquier otra tecla - no)
fr: Voulez-vous rejouer ? (Entrée - oui, toute autre touche - non)
it: Vuoi giocare di nuovo? (Invio - sì, qualsiasi altra chiave - no)
ja: また遊びたいですか？ (Enter - はい、その他のキー - いいえ)
nl: Wil je nog een keer spelen? (Enter - ja, elke andere toets - nee)
zh: 你想再玩一次嗎？ （輸入 - 是，任何其他鍵 - 否）

# SaveToFileErrorMessage
source: An error occurred while writing data to file
ar: حدث خطأ أثناء كتابة البيانات في الملف
fr: Une erreur s'est produite lors de l'écriture des données dans le fichier
it: Si è verificato un errore durante la scrittura dei dati nel file
ja: ファイルへのデータの書き込み中にエラーが発生しました
nl: Er is een fout opgetreden tijdens het schrijven van gegevens naar een bestand
zh: 將數據寫入文件時出錯

# SecondCommandMessage
source: generate file with current players games review
ar: إنشاء ملف مع نظرة عامة على ألعاب اللاعبين الحاليين
de: Generieren Sie eine Datei mit einer Übersicht der Spiele aktueller Spieler
es: generar un archivo con una descripción general de los juegos de los jugadores actuales
fr: générer un fichier avec un aperçu des parties des joueurs actuels
it: generare un file con una panoramica delle partite dei giocatori attuali
ja: 現在のプレーヤーのゲームの概要を含むファイルを生成する
nl: genereer een bestand met een overzicht van de spellen van huidige spelers
zh: 生成一個包含當前玩家遊戲概覽的文件

# SelectLanguageMessage
source: Please enter one of the suggested character combinations to select the language
ar: الرجاء إدخال إحدى مجموعات الأحرف المقترحة لتحديد اللغة
fr: Veuillez entrer l'une des combinaisons de caractères suggérées pour sélectionner la langue
it: Inserisci una delle combinazioni di caratteri suggerite per selezionare la lingua
ja: 言語を選択するには、提案された文字の組み合わせのいずれかを入力してください
nl: Voer een van de voorgestelde tekencombinaties in om de taal te selecteren
zh: 請輸入建議的字符組合之一以選擇語言

# SelectLanguageRetryMessage
source: You have entered the wrong combination of characters. Try again
ar: لقد أدخلت مجموعة خاطئة من الأحرف. حاول مرة أخرى
fr: Vous avez entré la mauvaise combinaison de caractères. Réessayer
it: Hai inserito la combinazione di caratteri sbagliata. Riprova
ja: 入力した文字の組み合わせが間違っています。 再試行
nl: U heeft de verkeerde combinatie van tekens ingevoerd. Probeer het nog eens
zh: 您輸入了錯誤的字符組合。 再試一次

# ThirdCommandMessage
source: generate file with all games review
ar: إنشاء ملف نظرة عامة لجميع الألعاب
de: Übersichtsdatei aller Spiele generieren
es: generar un archivo de resumen de todos los juegos
fr: générer un fichier de vue d'ensemble de tous les jeux
it: genera un file di panoramica di tutti i giochi
ja: すべてのゲームの概要ファイルを生成する
nl: genereer overzichtsbestand van alle spellen
zh: 生成所有遊戲的概覽文件

# WinnerDeclarationMessage
source: Player {0} won!
ar: فاز اللاعب {0}!
de: Spieler {0} hat gewonnen!
es: ¡El jugador {0} ganó!
fr: Le joueur {0} a gagné !
it: Il giocatore {0} ha vinto!
ja: プレーヤー {0} が勝ちました!
nl: Speler {0} heeft gewonnen!
zh: 玩家 {0} 贏了！

# WrongAgeMessage
source: Your age must be greater than {0} and less than {1} years
ar: يجب أن يكون عمرك أكبر من {0} وأقل من {1} عام
de: Ihr Alter muss größer als {0} und kleiner als {1} Jahre sein
es: Tu edad debe ser mayor de {0} y menor de {1} años
fr: Votre âge doit être supérieur à {0} et inférieur à {1} ans
it: La tua età deve essere maggiore di {0} e inferiore a {1} anni
ja: 年齢は {0} 歳以上 {1} 歳未満でなければなりません
nl: Uw leeftijd moet hoger zijn dan {0} en minder dan {1} jaar
zh: 您的年齡必須大於 {0} 且小於 {1} 歲

# WrongCellMessage
source: You entered the data in the wrong format or the cell you wanted to occupy is already occupied. There are {0} attempts left before the move goes to the opponent
ar: لقد أدخلت البيانات بتنسيق خاطئ ، أو أن الخلية التي تريد شغلها مشغولة بالفعل. بقي هناك {0} محاولة قبل تمرير الدور للخصم
de: Sie haben Daten im falschen Format eingegeben oder die Zelle, die Sie belegen wollten, ist bereits belegt. Es sind noch {0} Versuche übrig, bevor der Gegner an der Reihe ist
es: Ingresó datos en un formato incorrecto o la celda que deseaba ocupar ya está ocupada. Quedan {0} intentos antes de que pase el turno al oponente
fr: Vous avez entré des données dans le mauvais format, ou la cellule que vous vouliez occuper est déjà occupée. Il reste {0} tentatives avant que le tour ne passe à l'adversaire
it: Hai inserito i dati nel formato sbagliato oppure la cella che volevi occupare è già occupata. Rimangono {0} tentativi prima che il turno passi all'avversario
ja: 間違った形式でデータを入力したか、占有しようとしたセルが既に占有されています。対戦相手にターンが移るまであと {0} 回の試行があります
nl: Je hebt gegevens in het verkeerde formaat ingevoerd, of de cel die je wilde bezetten is al bezet. Er zijn nog {0} pogingen over voordat de beurt naar de tegenstander gaat
zh: 您輸入的數據格式錯誤，或者您要佔用的單元格已被佔用。在轉身傳給對手之前還有 {0} 次嘗試

# WrongCommandMessage
source: You have entered the wrong command
ar: لقد أدخلت أمرًا غير صالح
de: Sie haben einen ungültigen Befehl eingegeben
es: Ingresaste un comando inválido
fr: Vous avez saisi une commande non valide
it: Hai inserito un comando non valido
ja: 無効なコマンドを入力しました
nl: Je hebt een ongeldige opdracht ingevoerd
zh: 您輸入了無效的命令

# WrongInputFormatMessage
source: Your input's format is wrong. Please, try again
ar: تنسيق الإدخال الخاص بك غير صحيح. حاول مرة اخرى
de: Ihr Eingabeformat ist falsch. Bitte versuche es erneut
es: Su formato de entrada es incorrecto. Inténtalo de nuevo
fr: Votre format d'entrée est incorrect. Veuillez réessayer
it: Il tuo formato di input non è corretto. Per favore riprova
ja: 入力形式が正しくありません。もう一度お試しください
nl: Uw invoerformaat is onjuist. Probeer het opnieuw
zh: 您的輸入格式不正確。請再試一次

# WrongNameLengthMessage
source: Your name shouldn't be empty and its length can't exceed {0} symbols
ar: يجب ألا يكون اسمك فارغًا ، ولا يمكن أن يتجاوز طوله {0} حرفًا.
de: Ihr Name darf nicht leer sein und darf {0} Zeichen nicht überschreiten.
es: Su nombre no debe estar vacío y su longitud no puede exceder los {0} caracteres.
fr: Votre nom ne doit pas être vide et sa longueur ne peut pas dépasser {0} caractères.
it: Il tuo nome non deve essere vuoto e la sua lunghezza non può superare {0} caratteri.
ja: あなたの名前は空であってはならず、その長さは {0} 文字を超えることはできません。
nl: Uw naam mag niet leeg zijn en mag niet langer zijn dan {0} tekens.
zh: 您的姓名不能為空，並且其長度不能超過 {0} 個字符。
